In [38]:
import pandas as pd
df=pd.read_csv('datasets/student3.csv')

In [39]:
df

    roll     name class  marks    age
0      1     anil    TE   56.77  22.0
1      2     amit    TE   59.77  21.0
2      3   aniket    BE   76.88  19.0
3      4  ajinkya    TE   69.66  20.0
4      5     asha    TE   63.28   NaN
5      6   ayesha    BE     NaN  20.0
6      7     amar    BE   65.34  19.0
7      8    Amita    be   68.33  23.0
8      9     amol    TE   56.75  20.0
9      9     amol    TE   56.75  20.0
10    10    anmol    BE   78.66   NaN
11    11   surbhi    TE     NaN  23.0
12    12    Sujay    TE   74.12  22.0
13    13  subhash    be   88.45  21.0
14    14   sachin   NaN   59.33  21.0
15    15  shalini    TE   63.45  20.0

In [40]:
# find the average of age
x=df['age'].sum()

In [41]:
y=x/16

In [42]:
y

18.1875

In [44]:
z=df['marks '].sum()# marks is having one space
z

937.54

In [45]:
df.columns

Index(['roll', 'name', 'class', 'marks ', 'age'], dtype='object')

In [56]:
df.columns.str.strip()

AttributeError: 'Index' object has no attribute 'columns'

In [53]:
df

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [54]:
df['marks'].mean()

IndexError: only integers, slices (`:`), ellipsis (`...`), numpy.newaxis (`None`) and integer or boolean arrays are valid indices